/*
Напишите функцию `findCommonElements`, которая принимает два массива и возвращает массив, содержащий общие элементы из обоих массивов.

Входные данные:

- `array1`: Первый массив, содержащий любые типы данных.
- `array2`: Второй массив, содержащий любые типы данных.

Выходные данные:

- Массив, содержащий элементы, которые присутствуют в обоих исходных массивах.
- Если общих элементов нет, должен вернуться пустой массив

Пример использования:
findCommonElements([1, 2, 3], [2, 3, 4]) // [2, 3]

Подсказка: можно использовать функцию `includesElement`, которую мы написали ранее. Переписывать её не нужно, она доступна по всему проекту за счёт hoisting.
*/

function findCommonElements(array1, array2) {
  const result = [];

  // Перебираем первый массив
  for (let i = 0; i < array1.length; i++) {
    const element = array1[i];

    // Проверяем, есть ли элемент во втором массиве
    if (includesElement(array2, element)) {
      // И проверяем, нет ли его уже в результирующем массиве
      if (!includesElement(result, element)) {
        result.push(element);
      }
    }
  }

  return result;
}

console.log(findCommonElements([1, 2, 5, 4], [1, 2, 3, 4, 5])); 
// Ожидаемый вывод: [1, 2, 3, 4]